snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/ОтложенныеДвиженияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеДвиженияДокументов</name>
  <resources>
    <name>Движения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Добавлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокСсылка</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.УстановкаСтатусаКМ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИспользованныеКодыАгрегаций/ИспользованныеКодыАгрегаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованныеКодыАгрегаций</name>
  <comment>Использованные коды агрегаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ХранилищеКодовМаркировки/ХранилищеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХранилищеКодовМаркировки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ПередачаКодовМаркировкиМП</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <basedOn>Document.МаркировкаОстатковТЦ</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ВыкупИМ</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.Возврат1ИМ</types>
      <types>DocumentRef.МаркировкаОстатковТЦ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.ПередачаКодовМаркировкиМП</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.ЗаказИМ</types>
      <types>DocumentRef.ОприходованиеТМЦ</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.ВозвратИМ</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупповыхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШтучныхКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Карантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоШтуквХКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>EnumRef.СкладскиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <comment>Не нанесен</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ОтложенныеДвиженияДокументов/ManagerModule.bsl
Функция СохранитьДвижения(ДокСсылка, Движения) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда 
		Результат.Ошибки.Добавить("Не указан регистратор !");
		Возврат Результат;
	КонецЕсли;	
	
	Если НЕ Метаданные.РегистрыСведений.ОтложенныеДвиженияДокументов.Измерения.ДокСсылка.Тип.СодержитТип(ТипЗнч(ДокСсылка)) Тогда 
		ТекстОшибки = СтрШаблон("Движения документа: %1 не подлежат отложенной записи.", ТипЗнч(ДокСсылка));
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	НомерЗаписи = ПолучитьСледующийНомерЗаписи(ДокСсылка);
	
	НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
	НЗ.Отбор.НомерЗаписи.Установить(НомерЗаписи, Истина);
	
	Для Каждого Элемент Из Движения Цикл           
		Запись = НЗ.Добавить();
		
		Запись.ДокСсылка	= ДокСсылка;
		Запись.НомерЗаписи	= НомерЗаписи;
		
		Запись.ДатаПроведения	= ТекущаяДата();
		Запись.Автор			= ПараметрыСеанса.Пользователь;
		
		ЗаполнитьЗначенияСвойств(Запись, Элемент);		
	КонецЦикла;                        
	
	Попытка
		НЗ.Записать();		
		
		Результат.Успешно = Истина;
	Исключение                     
		Результат.Ошибки.Добавить("Ошибка записи отложенных движений документа ! " + ОписаниеОшибки());				
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции //СохранитьДвижения(ДокСсылка, Движения) Экспорт

Функция ПолучитьСледующийНомерЗаписи(ДокСсылка)
	НомерЗаписи = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1	
	|	НомерЗаписи
	|ИЗ
	|	РегистрСведений.ОтложенныеДвиженияДокументов
	|ГДЕ
	|	ДокСсылка = &ДокСсылка	
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи УБЫВ
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.НомерЗаписи) Тогда
		НомерЗаписи = Выборка.НомерЗаписи;
	КонецЕсли;
	
	Возврат НомерЗаписи + 1;
КонецФункции //ПолучитьСледующийНомерЗаписи()

Функция ЗаписатьОтложенныеДвиженияДокументов(пОбработки = Неопределено) Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();	
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();	
		
	рПроверки = МаркировкаКС.МожноЗапускатьФЗ("МаркировкаС.ЗаписатьОтложенныеДвиженияДокументов");
	Если НЕ рПроверки.Успешно Тогда
		ТекстСообщения = СтрСоединить(рПроверки.Ошибки, Символы.ПС) + ". Обработка отменена !";
		ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Ошибка");		
		Возврат рПроверки;
	КонецЕсли;
	
	мСсылки = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Ссылки", Новый Массив);
	Если ТипЗнч(мСсылки) = Тип("Массив") Тогда
		Ссылки = мСсылки;
	Иначе
		Ссылки = Новый Массив;
		Ссылки.Добавить(мСсылки);
	КонецЕсли;	
	
	ИмяРегистра = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяРегистра", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокСсылка,	
	|	Добавлять,
	|	ВЫРАЗИТЬ(ДокСсылка КАК Документ.ХранилищеКодовМаркировки).ДокОснование КАК ОснованиеХКМ
	|ИЗ
	|	РегистрСведений.ОтложенныеДвиженияДокументов 
	|ГДЕ
	|	НЕ ОшибкаОбработки
	|	И ДокСсылка.ВерсияДанных ЕСТЬ НЕ NULL
	|	И ДатаНачалаОбработки<=&ТекущаяДата	
	|" + ?(Ссылки.Количество() > 0, "И ДокСсылка В (&Ссылки)", "") + "
	|" + ?(ПустаяСтрока(ИмяРегистра), "", "И ИмяРегистра = &ИмяРегистра") + "
	|УПОРЯДОЧИТЬ ПО
	|	ДокСсылка.МоментВремени
	|";
	
	Запрос.УстановитьПараметр("Ссылки", 		Ссылки);
	Запрос.УстановитьПараметр("ИмяРегистра", 	ИмяРегистра);
	Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВсегоСтрок	= Выборка.Количество();         
	Сч			= 0;
	
	ТекстСообщения = СтрШаблон("Начало записи отл. движений. К обработке: %1 док-ов.", ВсегоСтрок);
	ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Информация");
	
	Пока Выборка.Следующий() Цикл
		ДокСсылка = Выборка.ДокСсылка;
		
		Если ТипЗнч(Выборка.ОснованиеХКМ) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			ОснованиеПНК = ПолучитьРеквизитШапки(Выборка.ОснованиеХКМ, "ДокОснование");
			Если ЗначениеЗаполнено(ОснованиеПНК) И ТипЗнч(ОснованиеПНК) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Час = (ТекущаяДата() - НачалоДня(ТекущаяДата()))/3600;
				Если Час < 2 ИЛИ Час > 4 Тогда 
					ТекстСообщения = СтрШаблон("Отложена запись движений документа: %1 до 2.00 ночи.", Выборка.ДокСсылка);
					ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Информация");
					Продолжить; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
		
		рЗаписи = ЗаписатьОтложенныеДвиженияДокумента(ДокСсылка, Выборка.Добавлять, ИмяРегистра);
		Если рЗаписи.Успешно Тогда
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;			
		Иначе
			МаркировкаКС.ДобавитьОшибки(Результат, рЗаписи);
		КонецЕсли;
		
		Сч = Сч + 1;		
		Если Сч % 10 = 0 Тогда                                                          
			ТекстСообщения = СтрШаблон("Запись отл. движений. Обработано: %1 из %2. Обработка: %3.", Сч, ВсегоСтрок, ДокСсылка);
			инт_ДлительныеОперации.СообщитьПрогресс(Формат(100*Сч/ВсегоСтрок, "ЧДЦ=2"), );		
		КонецЕсли;
	КонецЦикла;
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
	
	ТекстСообщения = СтрШаблон("Окончание записи отл. движений. Обработано: %1 док-ов. Ошибок обработки: %2.", ВсегоСтрок, (ВсегоСтрок - Результат.ОбработаноОбъектов));
	ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Информация", , , Результат.ВремяВыполнения);
	
	Результат.Сообщения.Добавить(ТекстСообщения);
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗаписатьОтложенныеДвижения(тПараметров = Неопределено) Экспорт

Функция ПеренестиОбработку(ДокСсылка) Экспорт
	Час = (ТекущаяДата() - НачалоДня(ТекущаяДата()))/3600;
	Если Час < 2 Тогда
		ДатаНачалаОбработки = НачалоДня(ТекущаяДата());	// На сегодня	
	Иначе                                                        
		ДатаНачалаОбработки = КонецДНя(ТекущаяДата()) + 1; // На завтра		
	КонецЕсли;             
	
	ДатаНачалаОбработки = ДатаНачалаОбработки + 2*60*60; 
	
	НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда
		Для каждого Запись Из НЗ Цикл
			Запись.ДатаНачалаОбработки 	= ДатаНачалаОбработки;					
			Запись.Автор				= ПараметрыСеанса.Пользователь;
		КонецЦикла;	
		
		НЗ.Записать();
	КонецЕсли;
КонецФункции //ПеренестиОбработку(ДокСсылка) Экспорт

Функция ЗаписатьОтложенныеДвиженияДокумента(ДокСсылка, Добавлять = Ложь, ВыбИмяРегистра = "") Экспорт
	Результат	= МаркировкаКС.СтруктураРезультата();
	Начало		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокСсылка.Установить(ДокСсылка, Истина);
	
	НЗ.Прочитать();
	
	ИндексыЗаписей = Новый Соответствие; 
	Для каждого Запись Из НЗ Цикл
		ИндексыЗаписей[ИндексСтроки(Запись)] = НЗ.Индекс(Запись);
		Если Запись.ЗагрузкаВыполняется Тогда 
			ТекстСообщения = СтрШаблон("");
			
			Результат.Ошибки.Добавить(ТекстСообщения);
			Результат.Успешно = Ложь;
			
			Возврат Результат; 
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Записи ИЗ &НЗ КАК НЗ
	|;
	|ВЫБРАТЬ
	|	ДокСсылка,
	|	ИмяРегистра,
	|	МАКСИМУМ(НомерЗаписи) КАК НомерЗаписи
	|ИЗ
	|	ВТ_Записи
	|ГДЕ
	|	НЕ ОшибкаОбработки
	|СГРУППИРОВАТЬ ПО
	|	ДокСсылка,
	|	ИмяРегистра
	|";	
	Запрос.УстановитьПараметр("НЗ", НЗ.Выгрузить( , "ДокСсылка,ИмяРегистра,НомерЗаписи,ОшибкаОбработки"));
	
	ОбработанныеРегистры = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяРегистра	= СокрЛП(Выборка.ИмяРегистра);
		Если ЗначениеЗаполнено(ВыбИмяРегистра) И ИмяРегистра <> ВыбИмяРегистра Тогда Продолжить КонецЕсли;
		Если ИмяРегистра = "РегистрСведений.ИспользованныеКодыАгрегаций" Тогда
			ОбработанныеРегистры[ИмяРегистра] = Выборка.НомерЗаписи;
			Продолжить;
		КонецЕсли;
		
		НомерСтроки = ИндексыЗаписей[ИндексСтроки(Выборка)];
		Если НомерСтроки <> Неопределено Тогда
			Запись = НЗ.Получить(НомерСтроки);
			
			ОбновитьЗапись(Запись, Новый Структура("ЗагрузкаВыполняется", Истина));			
			
			Если Запись.КоличествоЗаписей = 0 Тогда 
				рОчистки = ОчиститьНаборОтложенныхДвижений(ДокСсылка, ИмяРегистра); //MARK-2968 - очистка записей				
				Если рОчистки.Успешно Тогда
					ОбработанныеРегистры[ИмяРегистра] = Запись.НомерЗаписи;
					
					ТекстСообщения = СтрШаблон("Очищены дв. по док-ту: %1, дв.: %2, № записи: %3, кол. записей: %4, время записи: %5." , 
						ДокСсылка, ИмяРегистра, рОчистки.ОбработаноОбъектов, Запись.НомерЗаписи, рОчистки.ВремяВыполнения);
					Результат.Сообщения.Добавить(ТекстСообщения);
				Иначе
					МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);
					
					Запись.ОшибкаОбработки	= Истина;
					Запись.ТекстОшибки		= СтрСоединить(рОчистки.Ошибки, Символы.ПС);	
					
					ТекстСообщения = СтрШаблон("Ошибка очистки движений по док-ту: %1. %2 (№ записи %3). %4.", ДокСсылка, ИмяРегистра, Запись.НомерЗаписи, Запись.ТекстОшибки);
					ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Ошибка")
				КонецЕсли;
			ИначеЕсли Запись.ОшибкаОбработки Тогда
				ТекстОшибки = СтрШаблон("В процессе записи движений док-та: '%1' по регистру: '%2' уже происходили ошибки !", ДокСсылка, Запись.ИмяРегистра);
				Результат.Ошибки.Добавить(ТекстОшибки);
			Иначе			
				ТаблицаДвижений = ЗначениеИзСтрокиВнутр(Запись.Движения.Получить());
				рЗаписи = ЗаписатьНаборОтложенныхДвижений(ДокСсылка, ИмяРегистра, ТаблицаДвижений, Добавлять);
				Если рЗаписи.Успешно Тогда
					ОбработанныеРегистры[ИмяРегистра] = Запись.НомерЗаписи;
					
					ТекстСообщения = СтрШаблон("Записаны дв. по док-ту: %1, дв.: %2, № записи: %3, кол. записей: %4, время записи: %5." , 
						ДокСсылка, ИмяРегистра, ТаблицаДвижений.Количество(), Запись.НомерЗаписи, рЗаписи.ВремяВыполнения);
					Результат.Сообщения.Добавить(ТекстСообщения);
				Иначе
					МаркировкаКС.ДобавитьОшибки(Результат, рЗаписи);
					
					Запись.ОшибкаОбработки	= Истина;
					Запись.ТекстОшибки		= СтрСоединить(рЗаписи.Ошибки, Символы.ПС);	
					
					ТекстСообщения = СтрШаблон("Ошибка формирования движений по док-ту: %1. %2 (№ записи %3). %4.", ДокСсылка, ИмяРегистра, Запись.НомерЗаписи, Запись.ТекстОшибки);
					ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Ошибка")
				КонецЕсли;		
			КонецЕсли;			
		КонецЕсли;				
	КонецЦикла;
	
	Для каждого Запись Из НЗ Цикл
		НомерЗаписи = ОбработанныеРегистры[СокрЛП(Запись.ИмяРегистра)];
		Если ТипЗнч(НомерЗаписи) = Тип("Число") И Запись.НомерЗаписи <= НомерЗаписи Тогда
			УдалитьЗапись(Запись);
			Продолжить;
		КонецЕсли;     
		
		Если Запись.ОшибкаОбработки Тогда
			ОбновитьЗапись(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Результат.ВремяВыполнения   = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
	Результат.Успешно 			= (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗаписатьОтложенныеДвижения(ДокСсылка)

Функция ОбновитьЗапись(Запись_Ист, Реквизиты = Неопределено)
	МЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Запись_Ист);
	Если ТипЗнч(Реквизиты) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Реквизиты);	
	КонецЕсли;
	МЗ.Записать();
КонецФункции //ОбновитьЗапись(Запись_Ист, Реквизиты = Неопределено)

Функция УдалитьЗапись(Запись_Ист)
	МЗ = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Запись_Ист);	
	МЗ.Удалить();
КонецФункции //УдалитьЗапись(Запись_Ист)

Функция ОчиститьНаборОтложенныхДвижений(ДокСсылка, ИмяТаблицы)
	Результат	= МаркировкаКС.СтруктураРезультата();                         
	
	Начало	= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Таблица = МаркировкаКС.СтрокуВСтруктуру(ИмяТаблицы, "Тип,Вид", ".");	
	
	Менеджер = ПолучитьМенеджерРегистра(Таблица.Тип, Таблица.Вид);	
	
	Если Менеджер <> Неопределено Тогда		
		НЗ = Менеджер.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);		
		
		Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			НЗ.Прочитать();
			
			рОчистки = ЗаписатьНаборЗаписей(НЗ, Истина, Истина, "Очистка", Истина);			
			
			Если НЕ рОчистки.Успешно Тогда				
				МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);				
			КонецЕсли;				
		Иначе
			ТекстОшибки = СтрШаблон("Не поддерживаемый вид регистратора '%1' для регистра '%2' !", ТипЗнч(ДокСсылка), ИмяТаблицы);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		КонецЕсли;		
	Иначе                         
		ТекстОшибки = СтрШаблон("Не поддерживаемый регистр: '%1' !", ИмяТаблицы);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Результат.ВремяВыполнения   = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
	Результат.Успешно 			= (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;	
КонецФункции //ЗаписатьНаборОтложенныхДвижения(ДокСсылка, ИмяТаблицы, Движения)

Функция ПолучитьМенеджерРегистра(Тип, Вид)
	Менеджер 	= Неопределено;
	Если Тип = "РегистрСведений" Тогда
		Менеджер 	= РегистрыСведений[Вид];		
	ИначеЕсли Тип = "РегистрНакопления" Тогда
		Менеджер 	= РегистрыНакопления[Вид];		
	КонецЕсли;	
	
	Возврат Менеджер;
КонецФункции //ПолучитьМенеджерРегистра(Тип, Вид)

Функция ИндексСтроки(Запись)
	Возврат СокрЛП(Запись.ИмяРегистра) + "_" + МаркировкаКС.ЧислоБезДури(Запись.НомерЗаписи);
КонецФункции //ИндексСтроки(Запись)

Функция ЗаписатьНаборОтложенныхДвижений(ДокСсылка, ИмяТаблицы, ТаблицаДвижений, Добавлять = Ложь)
	Результат	= МаркировкаКС.СтруктураРезультата();                         
	
	Начало	= ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Таблица = МаркировкаКС.СтрокуВСтруктуру(ИмяТаблицы, "Тип,Вид", ".");	
	
	Менеджер = ПолучитьМенеджерРегистра(Таблица.Тип, Таблица.Вид);
	
	РазмерПорции = 5000;
	
	Если Менеджер <> Неопределено Тогда
		ВсегоСтрок	= ТаблицаДвижений.Количество();
		Сч			= 0;		
		
		НЗ = Менеджер.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ДокСсылка, Истина);
		
		Очистили = Ложь;
		Если ЗначениеЗаполнено(НЗ.Отбор.Регистратор.Значение) Тогда
			Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			НЗ.Прочитать();
			
			Если НЕ Добавлять Тогда
				рОчистки = ЗаписатьНаборЗаписей(НЗ, Истина, Истина, "Очистка", Истина);
			КонецЕсли;			
			
			Если рОчистки.Успешно Тогда
				Для каждого Запись_Ист Из ТаблицаДвижений Цикл
					#ЕСЛИ КЛИЕНТ ТОГДА
						ОбработкаПрерыванияПользователя();
					#КОНЕЦЕСЛИ
						
					Запись_Пол = НЗ.Добавить();
					ЗаполнитьЗначенияСвойств(Запись_Пол, Запись_Ист);
					
					Сч = Сч+1;
					Если Сч % РазмерПорции = 0 ИЛИ Сч = ВсегоСтрок Тогда
						рЗаписи = ЗаписатьНаборЗаписей(НЗ, Ложь, Ложь, "Запись порции", (Сч = ВсегоСтрок));
						Если рЗаписи.Успешно Тогда
							Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + НЗ.Количество();
							НЗ.Очистить();
						Иначе        
							МаркировкаКС.ДобавитьОшибки(Результат, рЗаписи);
							Прервать;
						КонецЕсли;
						
						//ВызватьПаузу(100);
					КонецЕсли;
				КонецЦикла;
				
				Если Результат.Ошибки.Количество() = 0 Тогда
					Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
					Если Время > 10 Тогда					
						ТекстСообщения = СтрШаблон("Увеличенное время записи движений ! Док.: '%1', регистр: '%2' !", ДокСсылка, ИмяТаблицы);
						ЗаписатьВЛог("ОтложенныеДвижения", ТекстСообщения, "Предупреждение", , , Время);					
					КонецЕсли;
				КонецЕсли;
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат, рОчистки);				
			КонецЕсли;				
		Иначе
			ТекстОшибки = СтрШаблон("Не поддерживаемый вид регистратора '%1' для регистра '%2' !", ТипЗнч(ДокСсылка), ИмяТаблицы);
			Результат.Ошибки.Добавить(ТекстОшибки);			
		КонецЕсли;		
	Иначе                         
		ТекстОшибки = СтрШаблон("Не поддерживаемый регистр: '%1' !", ИмяТаблицы);
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Результат.ВремяВыполнения   = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
	Результат.Успешно 			= (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;	
КонецФункции //ЗаписатьНаборОтложенныхДвижения(ДокСсылка, ИмяТаблицы, Движения)

Функция ЗаписатьНаборЗаписей(НЗ, Замещать, Очищать, Операция, ПоследняяПорция)
	Результат	= МаркировкаКС.СтруктураРезультата();
	
	МетаОбъект 	= Метаданные.НайтиПоТипу(ТипЗнч(НЗ));
	
	ИспользоватьУпрБлокировки = (МетаОбъект.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый);
	
	НЗ.ДополнительныеСвойства.Вставить("ПоследняяПорция", ПоследняяПорция);
	
	Если ИспользоватьУпрБлокировки Тогда
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);		
	КонецЕсли;	
	
	Попытка			
		Если ИспользоватьУпрБлокировки Тогда			
			УстановитьБлокировкуПоНаборуЗаписей(НЗ);
		КонецЕсли;		
		
		Если Очищать Тогда
			Результат.ОбработаноОбъектов = НЗ.Количество();
			НЗ.Очистить();
		КонецЕсли;
				
		НЗ.Записать(Замещать);
		
		Если ИспользоватьУпрБлокировки Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;		
	Исключение
		Если ТранзакцияАктивна() Тогда		
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ИмяТаблицы	= НЗ.МетаДанные().ПолноеИмя();
		ТекстОшибки = СтрШаблон("Ошибка записи НЗ ! Операция: '%1'. Причина: '%2' !", Операция, ОписаниеОшибки());		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецПопытки;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ЗаписатьНаборЗаписей(НЗ, Замещать, Очищать, Операция)

Функция УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
	МетаРегистр = НаборЗаписей.Метаданные();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки 					= Блокировка.Добавить(НаборЗаписей.Метаданные().ПолноеИмя());
	ЭлементБлокировки.Режим 			= РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.ИсточникДанных 	= НаборЗаписей.Выгрузить();  
	//++18.03.2026 Ратманов
	//Если МетаРегистр.Измерения.Найти("Номенклатура") <> Неопределено Тогда
	//	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", 	"Номенклатура");	
	//КонецЕсли;
	Если МетаРегистр.Измерения.Найти("ШтрихКодУпаковки") <> Неопределено Тогда
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ШтрихКодУпаковки", "ШтрихКодУпаковки");		
	КонецЕсли;
	
	Блокировка.Заблокировать();	
КонецФункции //УстановитьБлокировкуПоНаборуЗаписей(НаборЗаписей) Экспорт
